app/controllers/api_controller.rb

  def register
    validate_json({teacher: String, students: Array})
    return if performed?

    teacher = find_or_create_teacher(@json['teacher'])
    return if performed?

    # Register each student to teacher
    @json['students'].each do |student_email|
---
SELECT  `students`.* FROM `students` WHERE `students`.`email` = 'studentjon@example.com' LIMIT 1

  def suspend
    validate_json({student: String})
    return if performed?

    student = Student.find_by_email(@json['student'])
    if student.nil?
      render_error "Student email not found: #{@json['student']}"
      return
    end

    student.update_attributes!(is_suspended: true)
---
SELECT  `students`.* FROM `students` WHERE `students`.`email` = 'studentjon@example.com' LIMIT 1
UPDATE `students` SET `is_suspended` = TRUE, `updated_at` = '2019-02-02 05:53:01' WHERE `students`.`id` = 4

  def retrievefornotifications
    validate_json({teacher: String, notification: String})
    return if performed?

    teacher = Teacher.find_by_email(@json['teacher'])
---
SELECT  `teachers`.* FROM `teachers` WHERE `teachers`.`email` = 'teacherken@example.com' LIMIT 1

    def find_students(teacher_email)
      teacher = Teacher.find_by_email(teacher_email)
---
SELECT  `teachers`.* FROM `teachers` WHERE `teachers`.`email` = 'teacherpau@gmail.com' LIMIT 1

    def get_mentioned_students(notification)
      notification \
        .split(' ') \
        .select {|word| word.start_with?('@')} \
        .map {|mention| Student.find_by_email(mention[1..-1])} \
        .select {|student| student.present?}
---
SELECT  `students`.* FROM `students` WHERE `students`.`email` = 'studentron@example.com' LIMIT 1